##新电核
dherx<-function(xxx1,xxx2)
{
  a<-loadN()
  
  b<-subset(a,当前流程步骤=="电核")
  
  b<-subset(b,进件状态=="审核中" | 进件状态=="未处理")
  
  bb<-b[c("申请编号","区域中心","资料核实结束时间","初审结束时间","个人电核电话","单位电核电话区号","单位电核电话号码","单位电核电话分机号")]
  
  bb$资料核实结束时间[bb$资料核实结束时间==""]<-bb$初审结束时间[bb$资料核实结束时间==""]
  bb$资料核实结束时间<-as.POSIXct(bb$资料核实结束时间)
  
  #注意周末或休息日 此处减（1+放假天数）
  单电时间<-as.POSIXct(paste(Sys.Date()-1-xxx2," 16:30:00",sep=""))
  个电时间<-as.POSIXct(paste(Sys.Date()-1-xxx2," 20:00:00",sep=""))
  
  单电列表<-subset(bb,资料核实结束时间<单电时间)
  个电列表<-subset(bb,资料核实结束时间<个电时间)
  
  单电列表$申请编号<-as.factor(单电列表$申请编号)
  个电列表$申请编号<-as.factor(个电列表$申请编号)
  
  b_wjt<-read.csv(paste("lab/dh/",as.character(Sys.Date()),".csv",sep=""))
  b_wjt$被叫号码<-as.character(b_wjt$被叫号码)
  
  
  callrec<-dcast(b_wjt,被叫号码~呼叫结果,length)
  callrec$接听<-callrec$接听*100
  呼叫次数<-callrec$未接听+callrec$占线+callrec$接听
  callrec<-cbind.data.frame(被叫号码=callrec$被叫号码,呼叫次数)
  
  ###
  单电列表$单位电核电话号码<-gsub("=\"","",单电列表$单位电核电话号码)
  单电列表$单位电核电话号码<-gsub("\"","",单电列表$单位电核电话号码)
  
  单电列表$个人电核电话<-gsub("=\"","",单电列表$个人电核电话)
  单电列表$个人电核电话<-gsub("\"","",单电列表$个人电核电话)
  
  单电列表$单位电核电话区号<-gsub("=\"","",单电列表$单位电核电话区号)
  单电列表$单位电核电话区号<-gsub("\"","",单电列表$单位电核电话区号)
  
  单电列表$单位电核电话分机号<-gsub("=\"","",单电列表$单位电核电话分机号)
  单电列表$单位电核电话分机号<-gsub("\"","",单电列表$单位电核电话分机号)
  ###
  个电列表$单位电核电话号码<-gsub("=\"","",个电列表$单位电核电话号码)
  个电列表$单位电核电话号码<-gsub("\"","",个电列表$单位电核电话号码)
  
  个电列表$个人电核电话<-gsub("=\"","",个电列表$个人电核电话)
  个电列表$个人电核电话<-gsub("\"","",个电列表$个人电核电话)
  
  个电列表$单位电核电话区号<-gsub("=\"","",个电列表$单位电核电话区号)
  个电列表$单位电核电话区号<-gsub("\"","",个电列表$单位电核电话区号)
  
  个电列表$单位电核电话分机号<-gsub("=\"","",个电列表$单位电核电话分机号)
  个电列表$单位电核电话分机号<-gsub("\"","",个电列表$单位电核电话分机号)
  
  ###
  
  #单电处理
  单电列表[is.na(单电列表)]<-""
  单电列表$单位电核电话区号<-as.character(as.numeric(单电列表$单位电核电话区号))
  单电列表$单位电核电话区号[单电列表$单位电核电话区号=='512']<-""
  
  单电类1<-paste(单电列表$单位电核电话区号,单电列表$单位电核电话号码,单电列表$单位电核电话分机号,sep="")
  单电类2<-paste(单电列表$单位电核电话区号,单电列表$单位电核电话号码,sep="")
  
  单电列表<-cbind(单电列表,单电类1,单电类2)
  ##
  
  write.csv(单电列表,"temp/单电列表.csv")
  write.csv(个电列表,"temp/个电列表.csv")
  ##
  个电列表<-read.csv("temp/个电列表.csv")
  
  个电列表结果<- merge(个电列表,callrec,by.x="个人电核电话",by.y="被叫号码",all.x=T,all.y=F)
  个电列表结果<-个电列表结果[c("申请编号","区域中心","初审结束时间","资料核实结束时间","个人电核电话","呼叫次数")]
  个电列表结果$呼叫次数[is.na(个电列表结果$呼叫次数)]<-0
  期望呼叫次数<-1
  if (length(个电列表结果[,1]!=0))
  {个电列表结果<-cbind(个电列表结果,期望呼叫次数)
  个电时间前<-as.POSIXct(paste(Sys.Date()-2-xxx1," 20:00:00",sep=""))
  个电列表结果$期望呼叫次数[as.POSIXct(个电列表结果$资料核实结束时间)<=个电时间前]<-4
  个电完成判断<-!个电列表结果$期望呼叫次数>个电列表结果$呼叫次数
  个电列表结果<-cbind(个电列表结果,个电完成判断)
  个电未完成<-subset(个电列表结果,个电完成判断=="FALSE")
  write.xlsx(个电列表结果,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"个电全部相关件明细",append=T,row.names=F)
  }else{print("个电列表为空")
    个电未完成<-个电列表
    个电列表结果<-个电列表}
  
  ##table2
  单电列表<-read.csv("temp/单电列表.csv",stringsAsFactors = F)
  单电列表[is.na(单电列表)]<-""
  单电列表结果1<-merge(单电列表,callrec,by.x="单电类1",by.y="被叫号码",all.x=T,all.y=F)
  单电列表结果2<-merge(单电列表,callrec,by.x="单电类2",by.y="被叫号码",all.x=T,all.y=F)
  单电列表<-merge(单电列表,单电列表结果1,by="申请编号",all.x=T,all.y=F)
  单电列表<-merge(单电列表,单电列表结果2,by="申请编号",all.x=T,all.y=F)
  单电列表<-单电列表[,c(1,3:5,10,11,22,33)]
  colnames(单电列表)<-c("申请编号","区域中心","资料核实结束时间","初审结束时间","单电号码1_含分机","单电号码2","呼叫次数1","呼叫次数2")
  单电列表<-单电列表[c("申请编号","区域中心","初审结束时间","资料核实结束时间","单电号码1_含分机","单电号码2","呼叫次数1","呼叫次数2")]
  单电列表$呼叫次数1[is.na(单电列表$呼叫次数1)]<-0
  单电列表$呼叫次数2[is.na(单电列表$呼叫次数2)]<-0
  单电列表$呼叫次数2[as.character(单电列表$单电号码1_含分机)==as.character(单电列表$单电号码2)]<-0
  总呼叫次数<-单电列表$呼叫次数1+单电列表$呼叫次数2
  单电列表<-cbind(单电列表,总呼叫次数)
  
  期望呼叫次数<-1
  if (length(单电列表[,1]!=0))
      {单电列表结果<-cbind(单电列表,期望呼叫次数)
    单电时间前<-as.POSIXct(paste(Sys.Date()-2-xxx1," 16:30:00",sep=""))
    单电列表结果$期望呼叫次数[as.POSIXct(单电列表结果$资料核实结束时间)<=单电时间前]<-4
    
    单电完成判断<-!单电列表结果$期望呼叫次数>单电列表结果$总呼叫次数
    单电列表结果<-cbind(单电列表结果,单电完成判断)
    单电未完成<-subset(单电列表结果,单电完成判断=="FALSE")  
    write.xlsx(单电列表结果,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"单电全部相关件明细",append=T,row.names=F)
    }else{print("单电列表为空")
    单电未完成<-单电列表
    单电列表结果<-单电列表} 
  ################################
  ###1 done
  if (length(单电未完成[,1])>0 & length(个电未完成[,1])>0)
  {个电未完成汇总<-ddply(个电未完成,.(区域中心),summarize,未完成件数=length(申请编号))
  单电未完成汇总<-ddply(单电未完成,.(区域中心),summarize,未完成件数=length(申请编号))
  
  电核汇总<-merge(个电未完成汇总,单电未完成汇总,by="区域中心",all=T)
  电核汇总[is.na(电核汇总)]<-0
  colnames(电核汇总)<-c("区域中心","个电未完成数","单电未完成数")
  电核汇总$区域中心<-as.character(电核汇总$区域中心)
  totrow<-c("全国",sum(电核汇总$个电未完成数),sum(电核汇总$单电未完成数))
  电核汇总<-rbind(电核汇总,totrow)
  电核汇总$个电未完成数<-as.numeric(电核汇总$个电未完成数)
  电核汇总$单电未完成数<-as.numeric(电核汇总$单电未完成数)
  
  个电未完成x<-个电未完成
  单电未完成x<-单电未完成
  }
  ####2 done
  if (length(单电未完成[,1])==0 & length(个电未完成[,1])>0)
  {个电未完成汇总<-ddply(个电未完成,.(区域中心),summarize,未完成件数=length(申请编号))
  单电未完成汇总<-as.data.frame(cbind(as.character(个电未完成汇总[1,1]),0))
  colnames(单电未完成汇总)<-c("区域中心","未完成件数")
  
  电核汇总<-merge(个电未完成汇总,单电未完成汇总,by="区域中心",all=T)
  电核汇总[is.na(电核汇总)]<-0
  colnames(电核汇总)<-c("区域中心","个电未完成数","单电未完成数")
  电核汇总$区域中心<-as.character(电核汇总$区域中心)
  电核汇总$单电未完成数<-as.numeric(as.character(电核汇总$单电未完成数))
  totrow<-c("全国",sum(电核汇总$个电未完成数),sum(电核汇总$单电未完成数))
  电核汇总<-rbind(电核汇总,totrow)
  电核汇总$个电未完成数<-as.numeric(as.character(电核汇总$个电未完成数))
  电核汇总$单电未完成数<-as.numeric(as.character(电核汇总$单电未完成数))
  
  个电未完成x<-个电未完成
  单电未完成x<-as.data.frame("单电全部完成")
  }
  ####3 done
  if (length(单电未完成[,1])>0 & length(个电未完成[,1])==0)
  {单电未完成汇总<-ddply(单电未完成,.(区域中心),summarize,未完成件数=length(申请编号))
  个电未完成汇总<-as.data.frame(cbind(as.character(单电未完成汇总[1,1]),0))
  colnames(个电未完成汇总)<-c("区域中心","未完成件数")
  
  电核汇总<-merge(个电未完成汇总,单电未完成汇总,by="区域中心",all=T)
  电核汇总[is.na(电核汇总)]<-0
  colnames(电核汇总)<-c("区域中心","个电未完成数","单电未完成数")
  电核汇总$区域中心<-as.character(电核汇总$区域中心)
  电核汇总$个电未完成数<-as.numeric(as.character(电核汇总$个电未完成数))
  totrow<-c("全国",sum(电核汇总$个电未完成数),sum(电核汇总$单电未完成数))
  电核汇总<-rbind(电核汇总,totrow)
  电核汇总$个电未完成数<-as.numeric(as.character(电核汇总$个电未完成数))
  电核汇总$单电未完成数<-as.numeric(as.character(电核汇总$单电未完成数))
  
  单电未完成x<-单电未完成
  个电未完成x<-as.data.frame("个电全部完成")
  }
  
  ####4 done
  if (length(单电未完成[,1])==0 & length(个电未完成[,1])==0)
  {个电未完成x<-as.data.frame("个电全部完成")
  单电未完成x<-as.data.frame("单电全部完成")
  
  电核汇总<-NULL
  totrow<-c("全国",0,0)
  电核汇总<-as.data.frame(rbind(电核汇总,totrow))
  colnames(电核汇总)<-c("区域中心","个电未完成数","单电未完成数")
  rownames(电核汇总)<-1
  
  电核汇总$个电未完成数<-as.numeric(as.character(电核汇总$个电未完成数))
  电核汇总$单电未完成数<-as.numeric(as.character(电核汇总$单电未完成数))
  }
  ####################################
  write.xlsx(电核汇总,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"汇总",append=T,row.names=F)
  write.xlsx(个电未完成x,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"个电未完成件明细",append=T,row.names=F)
  write.xlsx(单电未完成x,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"单电未完成件明细",append=T,row.names=F)
  
  
  
  #注意周末或休息日 此处减（1+放假天数）
  bb<-a[c("申请编号","区域中心","初审单电开始时间","初审单电结束时间")]
  bb<-bb[bb$初审单电结束时间!="",]
  cc<-a[c("申请编号","区域中心","初审个电开始时间","初审个电结束时间")]
  cc<-cc[cc$初审个电结束时间!="",]
  开始时间<-as.POSIXct(paste(Sys.Date()-1-xxx2," 10:00:00",sep=""))
  结束时间<-as.POSIXct(paste(Sys.Date()-1-xxx2," 20:00:00",sep=""))
  
  bb<-bb[(as.POSIXct(bb$初审单电结束时间)>开始时间)&(as.POSIXct(bb$初审单电结束时间)<结束时间),]
  cc<-cc[(as.POSIXct(cc$初审个电结束时间)>开始时间)&(as.POSIXct(cc$初审个电结束时间)<结束时间),]
  # 单电耗时
  单电耗时<-difftime(bb$初审单电结束时间,bb$初审单电开始时间,units="mins")
  单电列表<-cbind(bb,单电耗时)
  单电列表<-单电列表[单电耗时>30,]
  # 个电耗时
  个电耗时<-difftime(cc$初审个电结束时间,cc$初审个电开始时间,units="mins")
  个电列表<-cbind(cc,个电耗时)
  个电列表<-个电列表[个电耗时>30,]
  if (length(个电列表[,1])==0 ){
    print("新流程个电无未完成件")
  }else {write.xlsx(个电列表,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"新流程个电未完成件明细",append=T,row.names=F)}
  if (length(单电列表[,1])==0 ){
    print("新流程单电无未完成件")
  }else {write.xlsx(单电列表,paste(Sys.Date()," 电核未完成件汇总.xlsx",sep=""),"新流程单电未完成件明细",append=T,row.names=F)}
}